-- นำเข้าข้อมูลสถานพยาบาลจาก GeoJSON

-- โรงพยาบาลทั่วไป
INSERT INTO health_facilities (name, typecode, changwat, lat, lon, risk_level, district_name) VALUES
('รพ.สตูล', 'รพ.ทั่วไป', 'สตูล', 6.619127, 100.070431, 'ความเสี่ยงปานกลาง', 'เมืองสตูล');

-- โรงพยาบาลชุมชน
INSERT INTO health_facilities (name, typecode, changwat, lat, lon, risk_level, district_name) VALUES
('รพ.ควนกาหลง', 'รพ.ชุมชน', 'สตูล', 6.865899, 99.974614, 'ความเสี่ยงต่ำ', 'ควนกาหลง'),
('รพ.ควนโดน', 'รพ.ชุมชน', 'สตูล', 6.776772, 100.095363, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.ท่าแพ', 'รพ.ชุมชน', 'สตูล', 6.788048, 99.970215, 'ความเสี่ยงต่ำ', 'ท่าแพ'),
('รพ.ทุ่งหว้า', 'รพ.ชุมชน', 'สตูล', 7.092565, 99.766717, 'ความเสี่ยงปานกลาง', 'ทุ่งหว้า'),
('รพ.มะนัง', 'รพ.ชุมชน', 'สตูล', 7.005997, 99.917009, 'ความเสี่ยงต่ำ', 'มะนัง'),
('รพ.ละงู', 'รพ.ชุมชน', 'สตูล', 6.83063, 99.78947, 'ความเสี่ยงปานกลาง', 'ละงู');

-- โรงพยาบาลส่งเสริมสุขภาพตำบล (รพ.สต.)
INSERT INTO health_facilities (name, typecode, changwat, lat, lon, risk_level, district_name) VALUES
('รพ.สต.เกาะสาหร่าย', 'รพ.สต.', 'สตูล', 6.670756, 99.862898, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.เกาะหลีเป๊ะ', 'รพ.สต.', 'สตูล', 6.494608, 99.307546, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.ขอนคลาน', 'รพ.สต.', 'สตูล', 7.007281, 99.683968, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.เขาขาว', 'รพ.สต.', 'สตูล', 6.913993, 99.823899, 'ความเสี่ยงสูงมาก', 'ละงู'),
('รพ.สต.คลองขุด', 'รพ.สต.', 'สตูล', 6.673773, 100.112093, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.สต.คลองขุด (สาขา)', 'รพ.สต.', 'สตูล', 6.64443, 100.07396, 'ความเสี่ยงสูง', 'ควนโดน'),
('รพ.สต.ควนกาหลง', 'รพ.สต.', 'สตูล', 6.841144, 100.071776, 'ความเสี่ยงต่ำ', 'ควนกาหลง'),
('รพ.สต.ควนขัน', 'รพ.สต.', 'สตูล', 6.625560, 100.044136, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.ควนโดน', 'รพ.สต.', 'สตูล', 6.786933, 100.080886, 'ความเสี่ยงต่ำ', 'ควนโดน'),
('รพ.สต.เจ๊ะบิลัง', 'รพ.สต.', 'สตูล', 6.655063, 99.983961, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.ตันหยงโป', 'รพ.สต.', 'สตูล', 6.595043, 99.959177, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.ตำมะลัง', 'รพ.สต.', 'สตูล', 6.537996, 100.052995, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.ท่าเรือ', 'รพ.สต.', 'สตูล', 6.824829, 99.931860, 'ความเสี่ยงปานกลาง', 'ควนกาหลง'),
('รพ.สต.ทุ่งนุ้ย', 'รพ.สต.', 'สตูล', 6.857056, 100.110714, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.สต.ทุ่งบุหลัง', 'รพ.สต.', 'สตูล', 7.03468, 99.68653, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.น้ำผุด', 'รพ.สต.', 'สตูล', 7.023325, 99.847394, 'ความเสี่ยงต่ำ', 'มะนัง'),
('รพ.สต.บ้านกะทูน-พิปูนล้นเกล้า', 'รพ.สต.', 'สตูล', 6.896269, 100.018926, 'ความเสี่ยงต่ำ', 'ควนกาหลง'),
('รพ.สต.บ้านกุบังปะโหลด', 'รพ.สต.', 'สตูล', 6.743220, 100.100193, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.สต.บ้านเกาะยาว  ตำบลปูยู', 'รพ.สต.', 'สตูล', 6.467061, 100.073379, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.บ้านเขาแดง ตำบลป่าแก่บ่อหิน', 'รพ.สต.', 'สตูล', 7.057724, 99.838397, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.บ้านควน', 'รพ.สต.', 'สตูล', 6.698670, 100.064454, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.บ้านควน ตำบลบ้านควน', 'รพ.สต.', 'สตูล', 6.702525, 100.066167, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.บ้านควนบ่อทอง ตำบลทุ่งนุ้ย', 'รพ.สต.', 'สตูล', 6.845734, 100.102145, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.สต.บ้านคีรีวง ตำบลทุ่งหว้า', 'รพ.สต.', 'สตูล', 7.092852, 99.809358, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.บ้านฉลุง ตำบลฉลุง', 'รพ.สต.', 'สตูล', 6.739771, 100.041767, 'ความเสี่ยงสูงมาก', 'เมืองสตูล'),
('รพ.สต.บ้านตันหยงกลิงตำบลเกาะสาหร่าย', 'รพ.สต.', 'สตูล', 6.72181, 99.86758, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.บ้านตันหยงละไน้ ตำบลแหลมสน', 'รพ.สต.', 'สตูล', 6.98457, 99.68186, 'ความเสี่ยงต่ำ', 'ละงู'),
('รพ.สต.บ้านทางยาง ตำบลสาคร', 'รพ.สต.', 'สตูล', 6.827112, 99.875329, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.บ้านทุ่ง ตำบลฉลุง', 'รพ.สต.', 'สตูล', 6.730415, 100.065216, 'ความเสี่ยงสูง', 'เมืองสตูล'),
('รพ.สต.บ้านทุ่งดินลุ่ม ตำบลป่าแก่บ่อหิน', 'รพ.สต.', 'สตูล', 7.056881, 99.801982, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.บ้านทุ่งไหม้  ตำบลน้ำผุด', 'รพ.สต.', 'สตูล', 6.954817, 99.841027, 'ความเสี่ยงปานกลาง', 'มะนัง'),
('รพ.สต.บ้านนาทอน ตำบลนาทอน', 'รพ.สต.', 'สตูล', 7.068572, 99.751935, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.บ้านในเมือง ตำบลละงู', 'รพ.สต.', 'สตูล', 6.950647, 99.792744, 'ความเสี่ยงต่ำ', 'ละงู'),
('รพ.สต.บ้านบ่อเจ็ดลูก', 'รพ.สต.', 'สตูล', 6.877568, 99.700002, 'ความเสี่ยงต่ำ', 'ละงู'),
('รพ.สต.บ้านปาเต๊ะ ตำบลเจ๊ะบิลัง', 'รพ.สต.', 'สตูล', 6.739658, 99.981690, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.บ้านแป-ระใต้', 'รพ.สต.', 'สตูล', 6.817987, 99.926008, 'ความเสี่ยงต่ำ', 'ท่าแพ'),
('รพ.สต.บ้านผัง 34  ตำบลอุใดเจริญ', 'รพ.สต.', 'สตูล', 6.879708, 99.911084, 'ความเสี่ยงปานกลาง', 'ควนกาหลง'),
('รพ.สต.บ้านผัง 50 ตำบลนิคมพัฒนา', 'รพ.สต.', 'สตูล', 6.941950, 99.885736, 'ความเสี่ยงต่ำ', 'ควนกาหลง'),
('รพ.สต.บ้านมะนัง ตำบลปาล์มพัฒนา', 'รพ.สต.', 'สตูล', 7.062887, 99.914517, 'ความเสี่ยงต่ำ', 'มะนัง'),
('รพ.สต.บ้านวังตง ตำบลนาทอน', 'รพ.สต.', 'สตูล', 6.985857, 99.751800, 'ความเสี่ยงต่ำ', 'ทุ่งหว้า'),
('รพ.สต.บ้านวังประจัน ตำบลวังประจัน', 'รพ.สต.', 'สตูล', 6.757332, 100.145950, 'ความเสี่ยงต่ำ', 'ควนโดน'),
('รพ.สต.บ้านวังพะเนียด ตำบลเกตรี', 'รพ.สต.', 'สตูล', 6.679914, 100.097880, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('รพ.สต.บ้านเหนือคลอง  ตำบลควนกาหลง', 'รพ.สต.', 'สตูล', 6.995425, 100.022697, 'ความเสี่ยงปานกลาง', 'ควนกาหลง'),
('รพ.สต.บ้านใหม่ ตำบลควนโพธิ์', 'รพ.สต.', 'สตูล', 6.778163, 100.025347, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.ปากน้ำ', 'รพ.สต.', 'สตูล', 6.847012, 99.760808, 'ความเสี่ยงสูง', 'ละงู'),
('รพ.สต.ปาล์มพัฒนา ', 'รพ.สต.', 'สตูล', 7.005844, 99.945185, 'ความเสี่ยงต่ำ', 'มะนัง'),
('รพ.สต.ปูยู', 'รพ.สต.', 'สตูล', 6.513990, 100.099380, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.แป-ระ', 'รพ.สต.', 'สตูล', 6.839275, 99.922096, 'ความเสี่ยงปานกลาง', 'ท่าแพ'),
('รพ.สต.ย่านซื่อ', 'รพ.สต.', 'สตูล', 6.757064, 100.069106, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('รพ.สต.ละงู', 'รพ.สต.', 'สตูล', 6.830146, 99.789926, 'ความเสี่ยงปานกลาง', 'ละงู'),
('รพ.สต.สาคร', 'รพ.สต.', 'สตูล', 6.740557, 99.897902, 'ความเสี่ยงต่ำ', 'เมืองสตูล'),
('รพ.สต.ห้วยไทร', 'รพ.สต.', 'สตูล', 6.8626, 99.87223, 'ความเสี่ยงปานกลาง', 'ละงู'),
('รพ.สต.แหลมสน', 'รพ.สต.', 'สตูล', 6.947910, 99.692131, 'ความเสี่ยงต่ำ', 'ละงู'),
('รพ.สต.อุใดเจริญ อำเภอควนกาหลง', 'รพ.สต.', 'สตูล', 6.894013, 99.940586, 'ความเสี่ยงต่ำ', 'ควนกาหลง');

-- ศูนย์สาธารณสุขชุมชน (ศสช.)
INSERT INTO health_facilities (name, typecode, changwat, lat, lon, risk_level, district_name) VALUES
('ศสช.กำแพง', 'ศสช.', 'สตูล', 6.87658, 99.78339, 'ความเสี่ยงสูง', 'ละงู'),
('ศสช.ท่าแพ', 'ศสช.', 'สตูล', 6.78817, 99.9701, 'ความเสี่ยงปานกลาง', 'ท่าแพ'),
('ศสช.พิมาน', 'ศสช.', 'สตูล', 6.62440, 100.06528, 'ความเสี่ยงปานกลาง', 'เมืองสตูล');

-- สำนักงานสาธารณสุข
INSERT INTO health_facilities (name, typecode, changwat, lat, lon, risk_level, district_name) VALUES
('สสจ.สตูล', 'สสจ', 'สตูล', 6.61903, 100.07022, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('สสอ.ควนกาหลง', 'สสอ.', 'สตูล', 6.85662, 100.03257, 'ความเสี่ยงต่ำ', 'ควนกาหลง'),
('สสอ.ควนโดน', 'สสอ.', 'สตูล', 6.78710, 100.07703, 'ความเสี่ยงปานกลาง', 'ควนโดน'),
('สสอ.ท่าแพ', 'สสอ.', 'สตูล', 6.79031, 99.96936, 'ความเสี่ยงปานกลาง', 'ท่าแพ'),
('สสอ.มะนัง', 'สสอ.', 'สตูล', 6.97368, 99.91766, 'ความเสี่ยงต่ำ', 'มะนัง'),
('สสอ.ละงู', 'สสอ.', 'สตูล', 6.89115, 99.78969, 'ความเสี่ยงสูง', 'ละงู'),
('สสอ.สตูล', 'สสอ', 'สตูล', 6.61903, 100.08451, 'ความเสี่ยงปานกลาง', 'เมืองสตูล'),
('สอน.เฉลิมพระเกียรติ', 'สอน.', 'สตูล', 6.9744, 99.91755, 'ความเสี่ยงต่ำ', 'มะนัง');
